
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7917066706)



<pre><code>Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hC7-7cPhFPp66jZFAlgzxLnwmsBKLjs2ecwoXEhCpCKiafpgM6zPAFDjWjD_a0BTGUZWwHNMYBx3pm6DANF0Mpw9GDqtbqEKq2rbDChEgS
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hpwWV-GkfwtrbDk9WknveO2dZkUwL5_B_6JdZUjdlkdNqdQ12zPqnuRh4jFcJ_Sy8bHljl7HoBhzRLe1prZ1FJLBfKczXOKC7syfbsSBgO
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jXaQ6g4QhT7KnRAt0Qg8kR94esMX3x0ZztRO-eiEsTiKOVPvFX_Zj58_iJz1wbbwt7tCmHTvU4BG2lYXGDnRps5NLiANnUOvyZq8SO3qIJ
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jF9wjOw_s4aPipUHE6ys2Ul1vh7Yui7qaogfZulFrYt2Fb469hWDCSRqPBngtY_BFN6MIHbFJMLVuepyFZYBuscI9Nb_v6J7kjBmOmFRxy
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.firebase-auth: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_firebase_project.ikigaikintore: Refreshing state... [id=projects/gig-japan-398904]%0Agoogle_identity_platform_config.firebase-auth-google: Refreshing state... [id=projects/gig-japan-398904/config]%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_service.backend-api-resources[&#34;run.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_service.backend-api-resources[&#34;secretmanager.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.writer&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/iam.workloadIdentityUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_secret_manager_secret.backend-sa-secret[&#34;weather_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A        id               = &#34;projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai&#34;%0A        name             = &#34;ikigai&#34;%0A        # (10 unchanged attributes hidden)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = false%0A        }%0A    }%0A%0A  # google_firebase_project.ikigaikintore will be destroyed%0A  # (because google_firebase_project.ikigaikintore is not in configuration)%0A  - resource &#34;google_firebase_project&#34; &#34;ikigaikintore&#34; {%0A      - display_name   = &#34;ikigaikintore&#34; -&gt; null%0A      - id             = &#34;projects/gig-japan-398904&#34; -&gt; null%0A      - project        = &#34;gig-japan-398904&#34; -&gt; null%0A      - project_number = &#34;139527520332&#34; -&gt; null%0A    }%0A%0A  # google_identity_platform_config.firebase-auth-google will be destroyed%0A  # (because google_identity_platform_config.firebase-auth-google is not in configuration)%0A  - resource &#34;google_identity_platform_config&#34; &#34;firebase-auth-google&#34; {%0A      - authorized_domains         = [%0A          - &#34;localhost&#34;,%0A          - &#34;gig-japan-398904.firebaseapp.com&#34;,%0A          - &#34;gig-japan-398904.web.app&#34;,%0A          - &#34;ikigaipanelview-behoxqotna-an.a.run.app&#34;,%0A        ] -&gt; null%0A      - autodelete_anonymous_users = true -&gt; null%0A      - id                         = &#34;projects/gig-japan-398904/config&#34; -&gt; null%0A      - name                       = &#34;projects/139527520332/config&#34; -&gt; null%0A      - project                    = &#34;gig-japan-398904&#34; -&gt; null%0A%0A      - quota {%0A          - sign_up_quota_config {%0A              - quota          = 1 -&gt; null%0A              - quota_duration = &#34;86400s&#34; -&gt; null%0A              - start_time     = &#34;2024-02-06T14:25:00Z&#34; -&gt; null%0A            }%0A        }%0A%0A      - sign_in {%0A          - allow_duplicate_emails = false -&gt; null%0A          - hash_config            = [%0A              - {%0A                  - algorithm      = &#34;SCRYPT&#34;%0A                  - memory_cost    = 14%0A                  - rounds         = 8%0A                  - salt_separator = &#34;Bw==&#34;%0A                  - signer_key     = &#34;zgfWXNJlcPHyMghDLJbhD2ZUL4sB90JZ4g5WrDxlW1qzaH6MsWsze0aq1NYMAD33s8jtsV8NBQLoETTueRE4bw==&#34;%0A                },%0A            ] -&gt; null%0A        }%0A%0A      - sms_region_config {%0A          - allowlist_only {%0A              - allowed_regions = [%0A                  - &#34;JP&#34;,%0A                ] -&gt; null%0A            }%0A        }%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase-auth will be destroyed%0A  # (because google_project_service.firebase-auth is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-auth&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/identitytoolkit.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;identitytoolkit.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;base_endpoint&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;base_endpoint&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;environment&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;environment&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_api_key&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_api_key&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_app_id&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_app_id&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_auth_domain&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_auth_domain&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_messaging_sender_id&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_messaging_sender_id&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_project_id&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_project_id&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;firebase_storage_bucket&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;firebase_storage_bucket&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret[&#34;user_auth&#34;] will be created%0A  &#43; resource &#34;google_secret_manager_secret&#34; &#34;frontend-sa-secret&#34; {%0A      &#43; create_time           = (known after apply)%0A      &#43; effective_annotations = (known after apply)%0A      &#43; effective_labels      = (known after apply)%0A      &#43; expire_time           = (known after apply)%0A      &#43; id                    = (known after apply)%0A      &#43; name                  = (known after apply)%0A      &#43; project               = &#34;gig-japan-398904&#34;%0A      &#43; secret_id             = &#34;user_auth&#34;%0A      &#43; terraform_labels      = (known after apply)%0A%0A      &#43; replication {%0A          &#43; auto {%0A            }%0A        }%0A    }%0A%0APlan: 9 to add, 1 to change, 7 to destroy.%0Agoogle_firebase_project.ikigaikintore: Destroying... [id=projects/gig-japan-398904]%0Agoogle_identity_platform_config.firebase-auth-google: Destroying... [id=projects/gig-japan-398904/config]%0Agoogle_firebase_project.ikigaikintore: Destruction complete after 0s%0Agoogle_identity_platform_config.firebase-auth-google: Destruction complete after 0s%0Agoogle_project_service.firebase-auth: Destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;base_endpoint&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;environment&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_project_id&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_api_key&#34;]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;base_endpoint&#34;]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_auth_domain&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_storage_bucket&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_app_id&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_messaging_sender_id&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;user_auth&#34;]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;environment&#34;]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_project_id&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_api_key&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_auth_domain&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_storage_bucket&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_app_id&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;firebase_messaging_sender_id&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.frontend-sa-secret[&#34;user_auth&#34;]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_service.firebase-auth: Still destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com, 10s elapsed]%0Agoogle_project_service.firebase-auth: Destruction complete after 11s%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hC7-7cPhFPp66jZFAlgzxLnwmsBKLjs2ecwoXEhCpCKiafpgM6zPAFDjWjD_a0BTGUZWwHNMYBx3pm6DANF0Mpw9GDqtbqEKq2rbDChEgS%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hpwWV-GkfwtrbDk9WknveO2dZkUwL5_B_6JdZUjdlkdNqdQ12zPqnuRh4jFcJ_Sy8bHljl7HoBhzRLe1prZ1FJLBfKczXOKC7syfbsSBgO%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jXaQ6g4QhT7KnRAt0Qg8kR94esMX3x0ZztRO-eiEsTiKOVPvFX_Zj58_iJz1wbbwt7tCmHTvU4BG2lYXGDnRps5NLiANnUOvyZq8SO3qIJ%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jF9wjOw_s4aPipUHE6ys2Ul1vh7Yui7qaogfZulFrYt2Fb469hWDCSRqPBngtY_BFN6MIHbFJMLVuepyFZYBuscI9Nb_v6J7kjBmOmFRxy%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/61d91c45-7170-45cd-836d-8dde7cbbb899/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_project_service.firebase-auth: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]
google_firebase_project.ikigaikintore: Refreshing state... [id=projects/gig-japan-398904]
google_identity_platform_config.firebase-auth-google: Refreshing state... [id=projects/gig-japan-398904/config]
google_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_firebase_project.ikigaikintore will be destroyed
  # (because google_firebase_project.ikigaikintore is not in configuration)
  - resource "google_firebase_project" "ikigaikintore" {
      - display_name   = "ikigaikintore" -> null
      - id             = "projects/gig-japan-398904" -> null
      - project        = "gig-japan-398904" -> null
      - project_number = "139527520332" -> null
    }

  # google_identity_platform_config.firebase-auth-google will be destroyed
  # (because google_identity_platform_config.firebase-auth-google is not in configuration)
  - resource "google_identity_platform_config" "firebase-auth-google" {
      - authorized_domains         = [
          - "localhost",
          - "gig-japan-398904.firebaseapp.com",
          - "gig-japan-398904.web.app",
          - "ikigaipanelview-behoxqotna-an.a.run.app",
        ] -> null
      - autodelete_anonymous_users = true -> null
      - id                         = "projects/gig-japan-398904/config" -> null
      - name                       = "projects/139527520332/config" -> null
      - project                    = "gig-japan-398904" -> null

      - quota {
          - sign_up_quota_config {
              - quota          = 1 -> null
              - quota_duration = "86400s" -> null
              - start_time     = "2024-02-06T14:25:00Z" -> null
            }
        }

      - sign_in {
          - allow_duplicate_emails = false -> null
          - hash_config            = [
              - {
                  - algorithm      = "SCRYPT"
                  - memory_cost    = 14
                  - rounds         = 8
                  - salt_separator = "Bw=="
                  - signer_key     = "zgfWXNJlcPHyMghDLJbhD2ZUL4sB90JZ4g5WrDxlW1qzaH6MsWsze0aq1NYMAD33s8jtsV8NBQLoETTueRE4bw=="
                },
            ] -> null
        }

      - sms_region_config {
          - allowlist_only {
              - allowed_regions = [
                  - "JP",
                ] -> null
            }
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase-auth will be destroyed
  # (because google_project_service.firebase-auth is not in configuration)
  - resource "google_project_service" "firebase-auth" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/identitytoolkit.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "identitytoolkit.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_secret_manager_secret.frontend-sa-secret["base_endpoint"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "base_endpoint"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["environment"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "environment"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_api_key"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_api_key"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_app_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_app_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_auth_domain"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_messaging_sender_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_project_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_project_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_storage_bucket"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["user_auth"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "user_auth"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 9 to add, 1 to change, 7 to destroy.
google_firebase_project.ikigaikintore: Destroying... [id=projects/gig-japan-398904]
google_identity_platform_config.firebase-auth-google: Destroying... [id=projects/gig-japan-398904/config]
google_firebase_project.ikigaikintore: Destruction complete after 0s
google_identity_platform_config.firebase-auth-google: Destruction complete after 0s
google_project_service.firebase-auth: Destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com]
google_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_secret_manager_secret.frontend-sa-secret["base_endpoint"]: Creating...
google_secret_manager_secret.frontend-sa-secret["environment"]: Creating...
google_secret_manager_secret.frontend-sa-secret["firebase_project_id"]: Creating...
google_secret_manager_secret.frontend-sa-secret["firebase_api_key"]: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_secret_manager_secret.frontend-sa-secret["base_endpoint"]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/base_endpoint]
google_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"]: Creating...
google_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"]: Creating...
google_secret_manager_secret.frontend-sa-secret["firebase_app_id"]: Creating...
google_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"]: Creating...
google_secret_manager_secret.frontend-sa-secret["user_auth"]: Creating...
google_secret_manager_secret.frontend-sa-secret["environment"]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/environment]
google_secret_manager_secret.frontend-sa-secret["firebase_project_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_project_id]
google_secret_manager_secret.frontend-sa-secret["firebase_api_key"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_api_key]
google_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_auth_domain]
google_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]
google_secret_manager_secret.frontend-sa-secret["firebase_app_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_app_id]
google_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]
google_secret_manager_secret.frontend-sa-secret["user_auth"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/user_auth]
google_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_service.firebase-auth: Still destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com, 10s elapsed]
google_project_service.firebase-auth: Destruction complete after 11s

Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hC7-7cPhFPp66jZFAlgzxLnwmsBKLjs2ecwoXEhCpCKiafpgM6zPAFDjWjD_a0BTGUZWwHNMYBx3pm6DANF0Mpw9GDqtbqEKq2rbDChEgS
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hpwWV-GkfwtrbDk9WknveO2dZkUwL5_B_6JdZUjdlkdNqdQ12zPqnuRh4jFcJ_Sy8bHljl7HoBhzRLe1prZ1FJLBfKczXOKC7syfbsSBgO
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jXaQ6g4QhT7KnRAt0Qg8kR94esMX3x0ZztRO-eiEsTiKOVPvFX_Zj58_iJz1wbbwt7tCmHTvU4BG2lYXGDnRps5NLiANnUOvyZq8SO3qIJ
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jF9wjOw_s4aPipUHE6ys2Ul1vh7Yui7qaogfZulFrYt2Fb469hWDCSRqPBngtY_BFN6MIHbFJMLVuepyFZYBuscI9Nb_v6J7kjBmOmFRxy
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.firebase-auth: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_firebase_project.ikigaikintore: Refreshing state... [id=projects/gig-japan-398904]%0Agoogle_identity_platform_config.firebase-auth-google: Refreshing state... [id=projects/gig-japan-398904/config]%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_firebase_project.ikigaikintore will be destroyed%0A  # (because google_firebase_project.ikigaikintore is not in configuration)%0A  - resource "google_firebase_project" "ikigaikintore" {%0A      - display_name   = "ikigaikintore" -> null%0A      - id             = "projects/gig-japan-398904" -> null%0A      - project        = "gig-japan-398904" -> null%0A      - project_number = "139527520332" -> null%0A    }%0A%0A  # google_identity_platform_config.firebase-auth-google will be destroyed%0A  # (because google_identity_platform_config.firebase-auth-google is not in configuration)%0A  - resource "google_identity_platform_config" "firebase-auth-google" {%0A      - authorized_domains         = [%0A          - "localhost",%0A          - "gig-japan-398904.firebaseapp.com",%0A          - "gig-japan-398904.web.app",%0A          - "ikigaipanelview-behoxqotna-an.a.run.app",%0A        ] -> null%0A      - autodelete_anonymous_users = true -> null%0A      - id                         = "projects/gig-japan-398904/config" -> null%0A      - name                       = "projects/139527520332/config" -> null%0A      - project                    = "gig-japan-398904" -> null%0A%0A      - quota {%0A          - sign_up_quota_config {%0A              - quota          = 1 -> null%0A              - quota_duration = "86400s" -> null%0A              - start_time     = "2024-02-06T14:25:00Z" -> null%0A            }%0A        }%0A%0A      - sign_in {%0A          - allow_duplicate_emails = false -> null%0A          - hash_config            = [%0A              - {%0A                  - algorithm      = "SCRYPT"%0A                  - memory_cost    = 14%0A                  - rounds         = 8%0A                  - salt_separator = "Bw=="%0A                  - signer_key     = "zgfWXNJlcPHyMghDLJbhD2ZUL4sB90JZ4g5WrDxlW1qzaH6MsWsze0aq1NYMAD33s8jtsV8NBQLoETTueRE4bw=="%0A                },%0A            ] -> null%0A        }%0A%0A      - sms_region_config {%0A          - allowlist_only {%0A              - allowed_regions = [%0A                  - "JP",%0A                ] -> null%0A            }%0A        }%0A    }%0A%0A  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase-auth will be destroyed%0A  # (because google_project_service.firebase-auth is not in configuration)%0A  - resource "google_project_service" "firebase-auth" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/identitytoolkit.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "identitytoolkit.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["base_endpoint"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "base_endpoint"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["environment"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "environment"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_api_key"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_api_key"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_app_id"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_app_id"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_auth_domain"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_messaging_sender_id"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_project_id"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_project_id"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "firebase_storage_bucket"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0A  # google_secret_manager_secret.frontend-sa-secret["user_auth"] will be created%0A  + resource "google_secret_manager_secret" "frontend-sa-secret" {%0A      + create_time           = (known after apply)%0A      + effective_annotations = (known after apply)%0A      + effective_labels      = (known after apply)%0A      + expire_time           = (known after apply)%0A      + id                    = (known after apply)%0A      + name                  = (known after apply)%0A      + project               = "gig-japan-398904"%0A      + secret_id             = "user_auth"%0A      + terraform_labels      = (known after apply)%0A%0A      + replication {%0A          + auto {%0A            }%0A        }%0A    }%0A%0APlan: 9 to add, 1 to change, 7 to destroy.%0Agoogle_firebase_project.ikigaikintore: Destroying... [id=projects/gig-japan-398904]%0Agoogle_identity_platform_config.firebase-auth-google: Destroying... [id=projects/gig-japan-398904/config]%0Agoogle_firebase_project.ikigaikintore: Destruction complete after 0s%0Agoogle_identity_platform_config.firebase-auth-google: Destruction complete after 0s%0Agoogle_project_service.firebase-auth: Destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_secret_manager_secret.frontend-sa-secret["base_endpoint"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["environment"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_project_id"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_api_key"]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_secret_manager_secret.frontend-sa-secret["base_endpoint"]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_app_id"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["user_auth"]: Creating...%0Agoogle_secret_manager_secret.frontend-sa-secret["environment"]: Creation complete after 0s [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_project_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_api_key"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_app_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.frontend-sa-secret["user_auth"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_service.firebase-auth: Still destroying... [id=gig-japan-398904/identitytoolkit.googleapis.com, 10s elapsed]%0Agoogle_project_service.firebase-auth: Destruction complete after 11s%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hC7-7cPhFPp66jZFAlgzxLnwmsBKLjs2ecwoXEhCpCKiafpgM6zPAFDjWjD_a0BTGUZWwHNMYBx3pm6DANF0Mpw9GDqtbqEKq2rbDChEgS%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hpwWV-GkfwtrbDk9WknveO2dZkUwL5_B_6JdZUjdlkdNqdQ12zPqnuRh4jFcJ_Sy8bHljl7HoBhzRLe1prZ1FJLBfKczXOKC7syfbsSBgO%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jXaQ6g4QhT7KnRAt0Qg8kR94esMX3x0ZztRO-eiEsTiKOVPvFX_Zj58_iJz1wbbwt7tCmHTvU4BG2lYXGDnRps5NLiANnUOvyZq8SO3qIJ%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jF9wjOw_s4aPipUHE6ys2Ul1vh7Yui7qaogfZulFrYt2Fb469hWDCSRqPBngtY_BFN6MIHbFJMLVuepyFZYBuscI9Nb_v6J7kjBmOmFRxy%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":54,"Program":"tfcmt","SHA1":"76d4e56311b525938f4c310b585c31248e0d4dab","Vars":{},"WorkflowName":"iaac_apply"} -->